BAS BMEKZU Project/src/InformationRegisters/ИНАГРО_Сельхозтехника/ИНАГРО_Сельхозтехника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИНАГРО_Сельхозтехника</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ВидТранспорта</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыТранспорта</types>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Гусеничный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Двигатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэфУЕГА</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаТрактора</name>
    <type>
      <types>EnumRef.ИНАГРО_МассаТрактора</types>
    </type>
  </resources>
  <resources>
    <name>НормаНаПрицеп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>Прицеп</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </resources>
  <resources>
    <name>СведенияИзГАИ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СвидетельствоОРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СвидетельствоОРегистрацииВыдано</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТехПаспорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТехСостояние</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Шасси</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемБункера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Enums/ИНАГРО_ВидыТехники/ИНАГРО_ВидыТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИНАГРО_ВидыТехники</name>
  <enumValues>
    <name>Автотранспорт</name>
  </enumValues>
  <enumValues>
    <name>Сельхозтехника</name>
  </enumValues>
  <enumValues>
    <name>Агрегат</name>
  </enumValues>
  <enumValues>
    <name>Прицеп</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/InformationRegisters/ИНАГРО_Сельхозтехника/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОсновноеСредствоПриИзменении(Элемент)
	
	Если ПолучитьЗначениеРеквизита(Запись.ОсновноеСредство) <> ПредопределенноеЗначение("Перечисление.ИНАГРО_ВидыТехники.Сельхозтехника") Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Выбранное ОС не является сельхозтехникой!';uk='Обраний ОЗ не є сільгосптехнікою!'");
		Сообщение.Сообщить();
		
		Запись.ОсновноеСредство = ПредопределенноеЗначение("Справочник.ОсновныеСредства.ПустаяСсылка"); 
		
	КонецЕсли;      	
	
КонецПроцедуры 

#КонецОбласти    

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизита(ОсновноеСредство)
	
	Возврат	ОсновноеСредство.Модель.ВидТехники;
	
КонецФункции

#КонецОбласти
